<template>
  <Main>
    <template #h1>Пользовательское соглашение</template>
    <div class="main__container">
      <p>1. Общие условия</p>
      <p>
        Косоногов Антон Александрович, являющийся самозанятым, предлагает всем
        желающим доступ к сервисам сайта http://itcats.ru.
      </p>
      <p>1.1. Основные понятия</p>
      <p>1.1.1 Сайт - сайт находящийся по адресу http://itcats.ru.</p>
      <p>
        1.1.2. Пользователь - пользователь сети интернет, пользующийся
        сервисами, которые предоставляет данный сайт.
      </p>
      <p>
        1.1.3. Администратор - Косоногов Антон Александрович, являющийся
        самозанятым. Предоставляет сервис на данном сайте.
      </p>
      <p>
        1.1.4. Продукт - курсы, консультации и иные информационные продукты,
        которые предоставляет администратор на сайте бесплатно или за плату.
      </p>
      <p>
        1.2. Использование сервиса регулируется условиями данного
        пользовательского соглашения.
      </p>
      <p>
        1.3. Начиная использовать сайт, пользователь обязуется ознакомиться с
        пользовательским соглашением, и самостоятельно несет риск такого
        неознакомления.
      </p>
      <p>
        Начиная использовать сайт/его отдельные функции, пользователь считается
        принявшим настоящие Условия, в полном объеме, без каких-либо оговорок и
        исключений.
      </p>
      <p>
        В случае несогласия пользователя с какими-либо из положений указанных
        документов, пользователь не вправе использовать сайт.
      </p>
      <p>
        1.4. Настоящее пользовательское соглашение может быть изменено
        администратором с предупреждением пользователей или без такового. В
        случае если пользователь не согласен с изменениями, он должен прекратить
        использование сайта.
      </p>
      <p>
        1.5. Используя сайт, пользователь дает свое согласие на получение
        сообщений и звонков информационного характера. Пользователь вправе
        отказаться от получения сообщений.
      </p>
      <p>2. Использование Сервиса.</p>
      <p>
        2.1. Сайт предоставляет ученикам курсы, учебные материалы для
        пользователей с целью самостоятельного обучения профессиональным навыкам
        в сфере программирования.
      </p>
      <p>
        2.2. Пользователь может получить подробную информацию о содержании
        продуктов, входящих в его состав программ, условиях и порядке их
        освоения, иных функциональных возможностях продуктов, размещённых на
        сайте.
      </p>
      <p>
        2.3. Для осуществления обратной связи, вопросов по продуктам, получения
        консультаций и других обращений следует обращаться по электронной почте
        itcats@yandex.ru.
      </p>
      <p>3. Оплата продуктов.</p>
      <p>
        3.1 Оплата продуктов осуществляется согласно условиям, указанным на
        сайте. Оплата поступает на банковский счёт администратора, являющегося
        самозанятым, а покупатель может получить чек.
      </p>
      <p>
        3.2 Оплата может осуществляться как полностью, так и в рассрочку в
        соответствии условиям сайта и договорам между пользователем и
        администратором.
      </p>
      <p>
        3.3 Пользователь даёт согласие на обработку банковской информации по
        оплате продуктов на сайте с целью контроля факты оплаты, предоставления
        бонусов пользователю, предоставление пользователю новых ещё более
        выгодных сервисов сайта.
      </p>
      <p>4. Интеллектуальная собственность.</p>
      <p>
        4.1. Права на все Материалы, включенные в состав сайта, а также дизайн
        сайта в целом и отдельные его элементы, права на программное обеспечение
        сайта, принадлежат администратору. Начиная использовать сайт,
        пользователь гарантирует, что не осуществляет и не будет осуществлять
        каких-либо действий, направленных на обход технических средств защиты от
        несанкционированного использования указанных выше объектов. Любое их
        копирование, воспроизведение, переработка, распространение, доведение до
        всеобщего сведения, обход средств технической защиты, либо иное
        использование вне рамок возможностей, предоставляемых сайтом, а также
        любое их использование в коммерческих целях запрещается.
      </p>
      <p>
        4.2. Пользователь самостоятельно несет ответственность перед третьими
        лицами за свои действия, связанные с размещением информации с
        использованием сайта, в том числе за то, что такое размещение
        соответствует требованиям законодательства и не нарушает права и
        законные интересы третьих лиц.
      </p>
      <p>
        Пользователь понимает и соглашается с тем, что размещаемая им
        информация, содержащая объекты интеллектуальных прав, не должна нарушать
        авторские права, права на товарные знаки, средства индивидуализации
        и/или иные интеллектуальные права, принадлежащие третьим лицам.
        Пользователь самостоятельно и за свой счет обязуется урегулировать все
        претензии третьих лиц, связанные с размещением (редактированием),
        распространением им информации, содержащей объекты интеллектуальных
        прав.
      </p>
      <p>
        4.3. Исключительные права на все результаты, созданные пользователем или
        при участии пользователя по заданиям администратора в ходе прохождения
        обучения по продуктам сайта, пользователь в полном объеме отчуждает
        администратору с момента их создания. Настоящим Пользователь дает
        согласие администратору на обнародование каждого материала, созданного
        пользователем в процессе обучения на сайте. Пользователь вправе
        размещать созданные результаты на внешних ресурсах, а также создавать и
        размещать портфолио, включающее выполненные практические задания в
        рамках обучения на сайте, на внешних ресурсах.
      </p>
      <p></p>
      <p>
        4.4 Информация, размещенная пользователями на сайте, может быть
        использована администратором в иных сервисах и приложениях.
      </p>
      <p>5. Ограничение ответственности</p>
      <p>
        5.1. Сайт предоставляется «как есть». Администратор не гарантирует
        соответствие сайта целям и ожиданиям пользователя, сохранность данных,
        представленных и размещенных пользователем на сайте, бесперебойную и
        безошибочную работу сайта в целом и его отдельных функциональных
        возможностей, в частности, администратор вправе в любой момент полностью
        или частично изменить функциональные возможности, предоставляемые
        сайтом.
      </p>
      <p></p>
      <p>
        5.2. Сайт не несет ответственности за какие-либо прямые или косвенные
        последствия какого-либо использования или невозможности использования
        сайта и/или ущерб, причиненный пользователю и/или третьим сторонам в
        результате какого-либо использования, неиспользования или невозможности
        использования сайта или отдельных его функций, в том числе из-за
        возможных ошибок или сбоев в работе сайта.
      </p>
      <p>
        5.3. Администратор оставляет за собой право на свое усмотрение
        ограничить доступ пользователя к сайту (или к определенным функциям
        сайта, если это возможно технологически) с использованием его учетной
        записи или полностью заблокировать учетную запись пользователя при
        неоднократном или грубом нарушении настоящего пользовательского
        соглашения, некорректном поведении в отношении иных пользователей, либо
        применить к пользователю иные меры с целью соблюдения требований
        законодательства или прав и законных интересов третьих лиц.
      </p>
      <p>6. Персональная информация. Иные положения</p>
      <p>
        6.1 Администратор осуществляет обработку персональной информации,
        предоставленной пользователями на сайте.
      </p>
      <p>
        6.2. Начиная использовать сайт, пользователь, выражает свое согласие на
        обработку персональной информации пользователя на сайте в соответствии с
        пользовательским соглашением.
      </p>
      <p>
        6.3 Администратор может собирать персональную информацию пользователей,
        используя различные скрипты, куки и другие технические средства с целью
        улучшения качества продуктов, предоставляемых на сайте.
      </p>
      <p>7. Иные положения</p>
      <p>
        7.1 Выполнение функций сайта возможно только при наличии доступа к сети
        интернет. Пользователь самостоятельно получает и оплачивает такой доступ
        на условиях и по тарифам своего оператора связи или провайдера доступа к
        сети интернет.
      </p>
      <p>
        7.2. Любая информация, используемая на сайте, предназначена
        исключительно для личного некоммерческого использования. При этом любое
        копирование информации сайта, в том числе с использованием
        автоматических и иных программных средств получения доступа к данным, ее
        воспроизведение, переработка, распространение, доведение до всеобщего
        сведения (опубликование) в сети Интернет, любое использование в
        средствах массовой информации и/или в коммерческих целях без
        предварительного письменного разрешения администратора запрещается.
      </p>
      <p>
        7.3. Все вопросы и претензии, связанные с использованием/невозможностью
        использования сайта, а также возможным нарушением пользователем сайта
        законодательства и/или прав третьих лиц, должны направляться по
        электронной почте itcats@yandex.ru
      </p>
      <p>8. Реквизиты администратора.</p>
      <p>Косоногов Антон Александрович</p>
      <p>ИНН 330576462410</p>
    </div>
  </Main>
</template>

<style lang="sass" scoped>
.main__container
    max-width: 1200px
    margin: 0 auto
    line-height: 2
</style>